[
  {
    "title": "UK Justice System Failing Cybercrime Victims, Cyber Helpline Finds ",
    "link": "https://www.infosecurity-magazine.com/news/uk-justice-cybercrime-victims/",
    "pubDate": "2024-11-29T09:15:00.000Z",
    "contentSnippet": "A report from the charity the Cyber Helpline found that 98% of cyber enabled crimes result in no further action from the police or justice system"
  },
  {
    "site": "The Hacker News",
    "title": "U.S. Citizen Sentenced for Spying on Behalf of China's Intelligence Agency",
    "link": "https://thehackernews.com/2024/11/us-citizen-sentenced-for-spying-on.html",
    "pubDate": "2024-11-29T05:31:00.000Z",
    "contentSnippet": "A 59-year-old U.S. citizen who immigrated from the People's Republic of China (PRC) has been sentenced to four years in prison for conspiring to act as a spy for the country and sharing sensitive information about his employer with China's principal civilian intelligence agency.\nPing Li, 59, of Wesley Chapel, Florida, is said to have served as a cooperative contact for the Ministry of State"
  },
  {
    "site": "Help Net Security",
    "title": "The effect of compliance requirements on vulnerability management strategies",
    "link": "https://www.helpnetsecurity.com/2024/11/29/steve-carter-nucleus-security-vulnerability-management-challenges/",
    "pubDate": "2024-11-29T05:30:29.000Z",
    "contentSnippet": "In this Help Net Security interview, Steve Carter, CEO of Nucleus Security, discusses the ongoing challenges in vulnerability management, including prioritizing vulnerabilities and addressing patching delays. Carter also covers compliance requirements and how automation can streamline vulnerability management processes. Why do you think challenges like prioritizing vulnerabilities and patching delays persist despite technological advances? The increasing complexity of enterprise infrastructure, expanding attack surface, and improved vulnerability and exposure detection capabilities have all led to a … More →\nThe post The effect of compliance requirements on vulnerability management strategies appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "Modernizing incident response in the AI era",
    "link": "https://www.helpnetsecurity.com/2024/11/29/incident-response-ai-video/",
    "pubDate": "2024-11-29T04:30:01.000Z",
    "contentSnippet": "In this Help Net Security video, Gourav Nagar, Director of Information Security at Bill, discusses modernizing incident response in the era of AI and the cloud: Why this issue is important for organizations looking to stay ahead of rapidly evolving cyber threats. How to adapt traditional incident response processes for cloud-native and AI-driven environments. How to leverage automation and orchestration in incident response while maintaining human oversight. Strategies for cultivating a security-first culture and improving … More →\nThe post Modernizing incident response in the AI era appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "AI-based tools designed for criminal activity are in high demand",
    "link": "https://www.helpnetsecurity.com/2024/11/29/ai-tools-ransomware/",
    "pubDate": "2024-11-29T04:30:01.000Z",
    "contentSnippet": "Multiple regional conflicts, such as Russia’s continued invasion of Ukraine and the Israel-Hamas conflict, have resulted in a surge in cyberattacks and hacktivist activities, according to Trellix. AI-driven ransomware boosts cybercrime tactics The research examines an increasingly complex ransomware ecosystem where groups have adopted advanced tools with embedded AI to spread ransomware. Trellix telemetry reveals China-affiliated threat actor groups remain a prevalent source of nation-state advanced persistent threat (APT) activities, with Mustang Panda generating more … More →\nThe post AI-based tools designed for criminal activity are in high demand appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "Infosec products of the month: November 2024",
    "link": "https://www.helpnetsecurity.com/2024/11/29/infosec-products-of-the-month-november-2024/",
    "pubDate": "2024-11-29T04:00:23.000Z",
    "contentSnippet": "Here’s a look at the most interesting products from the past month, featuring releases from: Absolute, Arkose Labs, Atakama, BlackFog, Eurotech, HiddenLayer, Hornetsecurity, Nirmata, Radware, Rakuten Viber, Symbiotic Security, Tanium, and Vectra AI. Tanium Cloud Workloads provides visibility and protection for containerized environments As part of the Tanium platform, Tanium Cloud Workloads reduces the risks associated with container deployments by identifying vulnerabilities and configuration issues in container images before they reach deployment. Atakama introduces DNS … More →\nThe post Infosec products of the month: November 2024 appeared first on Help Net Security."
  },
  {
    "title": "Malicious PyPI Package Exposes Crypto Wallets to Infostealer Code",
    "link": "https://www.infosecurity-magazine.com/news/malicious-pypi-exposes-crypto/",
    "pubDate": "2024-11-28T17:15:00.000Z",
    "contentSnippet": "A malicious PyPI package “aiocpa,” that stole crypto wallet data via obfuscated code, has been removed after being reported by Reversing Labs researchers"
  },
  {
    "site": "The Hacker News",
    "title": "Over Two Dozen Flaws Identified in Advantech Industrial Wi-Fi Access Points – Patch ASAP",
    "link": "https://thehackernews.com/2024/11/over-two-dozen-flaws-identified-in.html",
    "pubDate": "2024-11-28T16:57:00.000Z",
    "contentSnippet": "Nearly two dozen security vulnerabilities have been disclosed in Advantech EKI industrial-grade wireless access point devices, some of which could be weaponized to bypass authentication and execute code with elevated privileges.\n\"These vulnerabilities pose significant risks, allowing unauthenticated remote code execution with root privileges, thereby fully compromising the confidentiality,"
  },
  {
    "site": "BleepingComputer",
    "title": "Tor needs 200 new WebTunnel bridges to fight censorship",
    "link": "https://www.bleepingcomputer.com/news/security/tor-needs-200-new-webtunnel-bridges-to-fight-censorship/",
    "pubDate": "2024-11-28T16:50:22.000Z",
    "contentSnippet": "The Tor Project has put out an urgent call to the privacy community asking volunteers to help deploy 200 new WebTunnel bridges by the end of the year to fight government censorship. [...]"
  },
  {
    "title": "GodLoader Malware Infects Thousands via Game Development Tools",
    "link": "https://www.infosecurity-magazine.com/news/godloader-malware-infects/",
    "pubDate": "2024-11-28T16:30:00.000Z",
    "contentSnippet": "A new cyber-attack technique uses Godot Engine to deploy undetectable malware via GodLoader, infecting more than 17,000 devices"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Flipper Zero goes retro with this cool limited-edition transparent version for Black Friday",
    "link": "https://www.zdnet.com/article/flipper-zero-just-went-even-more-retro-with-this-cool-limited-edition-version/",
    "pubDate": "2024-11-28T14:54:56.000Z",
    "contentSnippet": "If you want one, you'd better act fast."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "NordPass password manager is now 56% off for Black Friday",
    "link": "https://www.zdnet.com/article/nordpass-black-friday-deal-11-28/",
    "pubDate": "2024-11-28T14:41:16.000Z",
    "contentSnippet": "The NordPass password manager is a great tool for preserving your privacy. Ahead of Black Friday, subscriptions are available with a massive discount for individuals and families."
  },
  {
    "site": "Help Net Security",
    "title": "Zyxel Networks SecuPilot simplifies threat analysis and reporting",
    "link": "https://www.helpnetsecurity.com/2024/11/28/zyxel-networks-secupilot/",
    "pubDate": "2024-11-28T13:31:05.000Z",
    "contentSnippet": "Zyxel Networks has launched SecuPilot, an AI assistant feature within its SecuReporter Cloud Analytics Service. By leveraging advanced generative AI, SecuPilot enables IT professionals to access actionable network insights, allowing them to identify and respond to security threats. Cut through the noise with AI-driven insights As network administrators face ever-increasing volumes of complex data logs and security threats, it can be a challenge to keep up. In response, Zyxel Networks’ SecuPilot helps users effortlessly analyze … More →\nThe post Zyxel Networks SecuPilot simplifies threat analysis and reporting appeared first on Help Net Security."
  },
  {
    "title": "Malicious Actors Exploit ProjectSend Critical Vulnerability ",
    "link": "https://www.infosecurity-magazine.com/news/exploit-projectsend-critical/",
    "pubDate": "2024-11-28T13:00:00.000Z",
    "contentSnippet": "This vulnerability was patched in May 2024 but was only allocated a CVE in November after evidence of exploitation"
  },
  {
    "site": "The Hacker News",
    "title": "The Future of Serverless Security in 2025: From Logs to Runtime Protection",
    "link": "https://thehackernews.com/2024/11/the-future-of-serverless-security-in.html",
    "pubDate": "2024-11-28T11:30:00.000Z",
    "contentSnippet": "Serverless environments, leveraging services such as AWS Lambda, offer incredible benefits in terms of scalability, efficiency, and reduced operational overhead. However, securing these environments is extremely challenging. The core of current serverless security practices often revolves around two key components: log monitoring and static analysis of code or system configuration. But here is"
  },
  {
    "title": "Critical Vulnerabilities Discovered in Industrial Wireless Access Point",
    "link": "https://www.infosecurity-magazine.com/news/critical-vulnerabilities/",
    "pubDate": "2024-11-28T11:15:00.000Z",
    "contentSnippet": "Customers of Advantech’s EKI-6333AC-2G industrial-grade wireless access point have been urged to update their devices to new firmware versions"
  },
  {
    "site": "The Hacker News",
    "title": "XML-RPC npm Library Turns Malicious, Steals Data, Deploys Crypto Miner",
    "link": "https://thehackernews.com/2024/11/xmlrpc-npm-library-turns-malicious.html",
    "pubDate": "2024-11-28T10:48:00.000Z",
    "contentSnippet": "Cybersecurity researchers have discovered a software supply chain attack that has remained active for over a year on the npm package registry by starting off as an innocuous library and later adding malicious code to steal sensitive data and mine cryptocurrency on infected systems.\nThe package, named @0xengine/xmlrpc, was originally published on October 2, 2023 as a JavaScript-based XML-RPC"
  },
  {
    "title": "Albanian Drug Smugglers Busted After Cops Decrypt Comms",
    "link": "https://www.infosecurity-magazine.com/news/albanian-drug-busted-cops-decrypt/",
    "pubDate": "2024-11-28T10:30:00.000Z",
    "contentSnippet": "European police have arrested 21 individuals linked to a violent Albanian gang after decrypting their Sky ECC communications"
  },
  {
    "site": "BleepingComputer",
    "title": "UK hospital network postpones procedures after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/uk-hospital-network-postpones-procedures-after-cyberattack/",
    "pubDate": "2024-11-28T10:08:58.000Z",
    "contentSnippet": "Major UK healthcare provider Wirral University Teaching Hospital (WUTH), part of the NHS Foundation Trust, has suffered a cyberattack that caused a systems outage leading to postponing appointments and scheduled procedures. [...]"
  },
  {
    "title": "T-Mobile Claims Salt Typhoon Did Not Access Customer Data",
    "link": "https://www.infosecurity-magazine.com/news/tmobile-salt-typhoon-did-not/",
    "pubDate": "2024-11-28T09:45:00.000Z",
    "contentSnippet": "The CSO of T-Mobile has clarified that no customer information was stolen by Chinese hacking group Salt Typhoon"
  },
  {
    "site": "The Hacker News",
    "title": "Cybercriminals Exploit Popular Game Engine Godot to Distribute Cross-Platform Malware",
    "link": "https://thehackernews.com/2024/11/cybercriminals-exploit-popular-game.html",
    "pubDate": "2024-11-28T09:29:00.000Z",
    "contentSnippet": "A popular open-source game engine called Godot Engine is being misused as part of a new GodLoader malware campaign, infecting over 17,000 systems since at least June 2024.\n\"Cybercriminals have been taking advantage of Godot Engine to execute crafted GDScript code which triggers malicious commands and delivers malware,\" Check Point said in a new analysis published Wednesday. \"The technique"
  },
  {
    "site": "Help Net Security",
    "title": "Why cybersecurity leaders trust the MITRE ATT&CK Evaluations",
    "link": "https://www.helpnetsecurity.com/2024/11/28/cynet-mitre-attck-evaluations/",
    "pubDate": "2024-11-28T05:46:53.000Z",
    "contentSnippet": "In today’s dynamic threat landscape, security leaders are under constant pressure to make informed choices about which solutions and strategies they employ to protect their organizations. The “MITRE Engenuity ATT&CK Evaluations: Enterprise” stand out as an essential resource for cybersecurity decision makers to navigate this challenge. Unlike other independent assessments, MITRE ATT&CK Evaluations simulate real-world threats to assess how competing cybersecurity vendors detect and respond to real-world threats. As soon as the highly anticipated 2024 MITRE … More →\nThe post Why cybersecurity leaders trust the MITRE ATT&CK Evaluations appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "How the role of observability is changing within organizations",
    "link": "https://www.helpnetsecurity.com/2024/11/28/observability-role-video/",
    "pubDate": "2024-11-28T05:30:45.000Z",
    "contentSnippet": "In this Help Net Security video, Nic Benders, Chief Technical Strategist at New Relic, discusses the key findings of a recent 2024 Observability Forecast report. The annual survey of 1,700 technology professionals across 16 countries reveals that: IT outages can cost up to $1.9 million per hour. The median annual downtime across all business impact levels was 3 days (77 hours). Network failure is the leading cause of outages (34%), outranking someone making a change … More →\nThe post How the role of observability is changing within organizations appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "VPN vulnerabilities, weak credentials fuel ransomware attacks",
    "link": "https://www.helpnetsecurity.com/2024/11/28/vpn-weak-credentials-ransomware-attacks/",
    "pubDate": "2024-11-28T05:00:41.000Z",
    "contentSnippet": "Attackers leveraging virtual private network (VPN) vulnerabilities and weak passwords for initial access contributed to nearly 30% of ransomware attacks, according to Corvus Insurance. According to the Q3 report, many of these incidents were traced to outdated software or VPN accounts with inadequate protection. For example, common usernames such as “admin” or “user” and a lack of multi-factor authentication (MFA) made accounts vulnerable to automated brute-force attacks, where attackers exploit publicly accessible systems by testing … More →\nThe post VPN vulnerabilities, weak credentials fuel ransomware attacks appeared first on Help Net Security."
  },
  {
    "site": "The Hacker News",
    "title": "U.S. Telecom Giant T-Mobile Detects Network Intrusion Attempts from Wireline Provider",
    "link": "https://thehackernews.com/2024/11/us-telecom-giant-t-mobile-detects.html",
    "pubDate": "2024-11-28T04:37:00.000Z",
    "contentSnippet": "U.S. telecom service provider T-Mobile said it recently detected attempts made by bad actors to infiltrate its systems in recent weeks but noted that no sensitive data was accessed.\nThese intrusion attempts \"originated from a wireline provider's network that was connected to ours,\" Jeff Simon, chief security officer at T-Mobile, said in a statement. \"We see no instances of prior attempts like"
  },
  {
    "site": "Help Net Security",
    "title": "Crypto companies are losing ground to deepfake attacks",
    "link": "https://www.helpnetsecurity.com/2024/11/28/crypto-deepfake-fraud/",
    "pubDate": "2024-11-28T04:30:29.000Z",
    "contentSnippet": "The crypto sector stands out as the only surveyed industry where deepfake fraud surpasses traditional document fraud in prevalence, according to Regula. Crypto companies suffer significant losses from fraud The study finds that 57% of crypto companies report audio deepfake incidents, compared to just 45% facing fake or modified document fraud. Research further reveals that 53% of crypto firms have encountered video deepfake fraud, cementing deepfakes as a top concern. In contrast, other industries continue … More →\nThe post Crypto companies are losing ground to deepfake attacks appeared first on Help Net Security."
  },
  {
    "site": "Help Net Security",
    "title": "Ransomware payments are now a critical business decision",
    "link": "https://www.helpnetsecurity.com/2024/11/28/ransomware-payment-demands/",
    "pubDate": "2024-11-28T04:00:44.000Z",
    "contentSnippet": "Despite the efforts of law enforcement agencies to stop and bring to justice those responsible for ransomware attacks, the situation is not improving. While authorities do not recommend making a ransomware payment, some companies are forced to make that choice in order to continue their operations. In this article, we present some important statistics about the ransom demands that companies are facing. 83% of organizations experienced at least one ransomware attack in the last year … More →\nThe post Ransomware payments are now a critical business decision appeared first on Help Net Security."
  },
  {
    "site": "BleepingComputer",
    "title": "Microsoft re-releases Exchange updates after fixing mail delivery",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-re-releases-exchange-updates-after-fixing-mail-delivery/",
    "pubDate": "2024-11-27T22:34:12.000Z",
    "contentSnippet": "​Microsoft has re-released the November 2024 security updates for Exchange Server after pulling them earlier this month due to email delivery issues on servers using custom mail flow rules. [...]"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Gen AI could speed up coding, but businesses should still consider risks",
    "link": "https://www.zdnet.com/article/gen-ai-could-speed-up-coding-but-businesses-should-still-consider-risks/",
    "pubDate": "2024-11-27T21:46:00.000Z",
    "contentSnippet": "Organizations keen to fund gen AI-powered software development for the anticipated benefits should also understand that this may come with adverse effects."
  },
  {
    "site": "BleepingComputer",
    "title": "Hackers abuse popular Godot game engine to infect thousands of PCs",
    "link": "https://www.bleepingcomputer.com/news/security/new-godloader-malware-infects-thousands-of-gamers-using-godot-scripts/",
    "pubDate": "2024-11-27T21:17:08.000Z",
    "contentSnippet": "​Hackers have used new GodLoader malware exploiting the capabilities of the widely used Godot game engine to evade detection and infect over 17,000 systems in just three months. [...]"
  },
  {
    "site": "BleepingComputer",
    "title": "Hackers exploit ProjectSend flaw to backdoor exposed servers",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-projectsend-flaw-to-backdoor-exposed-servers/",
    "pubDate": "2024-11-27T21:00:41.000Z",
    "contentSnippet": "Threat actors are using public exploits for a critical authentication bypass flaw in ProjectSend to upload webshells and gain remote access to servers. [...]"
  },
  {
    "site": "BleepingComputer",
    "title": "Zello asks users to reset passwords after security incident",
    "link": "https://www.bleepingcomputer.com/news/security/zello-asks-users-to-reset-passwords-after-security-incident/",
    "pubDate": "2024-11-27T19:41:48.000Z",
    "contentSnippet": "Zello is warning customers to reset their passwords if their account was created before November 2nd in what appears to be another security breach. [...]"
  },
  {
    "site": "BleepingComputer",
    "title": "Microsoft says it's not using your Word, Excel data for AI training",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-its-not-using-your-word-excel-data-for-ai-training/",
    "pubDate": "2024-11-27T18:57:10.000Z",
    "contentSnippet": "​Microsoft has denied claims that it uses Microsoft 365 apps (including Word, Excel, and PowerPoint) to collect data to train the company's artificial intelligence (AI) models. [...]"
  },
  {
    "site": "BleepingComputer",
    "title": "Researchers discover first UEFI bootkit malware for Linux",
    "link": "https://www.bleepingcomputer.com/news/security/researchers-discover-bootkitty-first-uefi-bootkit-malware-for-linux/",
    "pubDate": "2024-11-27T17:37:33.000Z",
    "contentSnippet": "The first UEFI bootkit specifically targeting Linux systems has been discovered, marking a shift in stealthy and hard-to-remove bootkit threats that previously focused on Windows. [...]"
  },
  {
    "title": "Attack Group APT-C-60 Targets Japan Using Trusted Platforms",
    "link": "https://www.infosecurity-magazine.com/news/aptc60-targets-japan-using-trusted/",
    "pubDate": "2024-11-27T17:15:00.000Z",
    "contentSnippet": "APT-C-60 targets Japan with phishing emails, using job application ruse and malware via Google Drive"
  },
  {
    "site": "BleepingComputer",
    "title": "Chinese hackers breached T-Mobile's routers to scope out network",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-breached-t-mobiles-routers-to-scope-out-network/",
    "pubDate": "2024-11-27T16:53:41.000Z",
    "contentSnippet": "T-Mobile says the Chinese \"Salt Typhoon\" hackers who recently compromised its systems as part of a series of telecom breaches first hacked into some of its routers to explore ways to navigate laterally through the network.  [...]"
  },
  {
    "title": "New Bootkit “Bootkitty” Targets Linux Systems via UEFI",
    "link": "https://www.infosecurity-magazine.com/news/bootkit-bootkitty-targets-linux/",
    "pubDate": "2024-11-27T16:30:00.000Z",
    "contentSnippet": "Bootkitty, the first Linux-targeting UEFI bootkit, bypassed kernel security in a proof-of-concept attack"
  },
  {
    "site": "BleepingComputer",
    "title": "Cloudflare says it lost 55% of logs pushed to customers for 3.5 hours",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-says-it-lost-55-percent-of-logs-pushed-to-customers-for-35-hours/",
    "pubDate": "2024-11-27T16:15:27.000Z",
    "contentSnippet": "Internet security giant Cloudflare announced that it lost 55% of all logs pushed to customers over a 3.5-hour period due to a bug in the log collection service on November 14, 2024. [...]"
  },
  {
    "title": "New EU Commission to Unveil Healthcare Cybersecurity Plan in First 100 Days",
    "link": "https://www.infosecurity-magazine.com/news/eu-commission-healthcare-cyber-plan/",
    "pubDate": "2024-11-27T16:10:00.000Z",
    "contentSnippet": "One of the priorities of the newly-approved Von der Leyen Commission II will be to strengthen the healthcare sector’s cyber resilience"
  },
  {
    "site": "The Hacker News",
    "title": "Critical Flaw in ProjectSend Under Active Exploitation Against Public-Facing Servers",
    "link": "https://thehackernews.com/2024/11/critical-flaw-in-projectsend-under.html",
    "pubDate": "2024-11-27T16:05:00.000Z",
    "contentSnippet": "A critical security flaw impacting the ProjectSend open-source file-sharing application has likely come under active exploitation in the wild, according to findings from VulnCheck.\nThe vulnerability, originally patched over a year-and-a-half ago as part of a commit pushed in May 2023 , was not officially made available until August 2024 with the release of version r1720. As of November 26, 2024,"
  },
  {
    "site": "The Hacker News",
    "title": "Researchers Discover \"Bootkitty\" – First UEFI Bootkit Targeting Linux Kernels",
    "link": "https://thehackernews.com/2024/11/researchers-discover-bootkitty-first.html",
    "pubDate": "2024-11-27T16:05:00.000Z",
    "contentSnippet": "Cybersecurity researchers have shed light on what has been described as the first Unified Extensible Firmware Interface (UEFI) bootkit designed for Linux systems.\nDubbed Bootkitty by its creators who go by the name BlackCat, the bootkit is assessed to be a proof-of-concept (PoC) and there is no evidence that it has been put to use in real-world attacks. Also tracked as IranuKit, it was uploaded"
  },
  {
    "site": "BleepingComputer",
    "title": "Police bust pirate streaming service making €250 million per month",
    "link": "https://www.bleepingcomputer.com/news/technology/police-bust-pirate-streaming-service-making-250-million-per-month/",
    "pubDate": "2024-11-27T14:14:39.000Z",
    "contentSnippet": "An international law enforcement operation has dismantled a pirate streaming service that served over 22 million users worldwide and made €250 million ($263M) per month. [...]"
  },
  {
    "site": "BleepingComputer",
    "title": "The Black Friday 2024 Cybersecurity, IT, VPN, & Antivirus Deals",
    "link": "https://www.bleepingcomputer.com/news/security/the-black-friday-2024-cybersecurity-it-vpn-and-antivirus-deals/",
    "pubDate": "2024-11-27T13:48:59.000Z",
    "contentSnippet": "Black Friday 2024 is almost here, and great deals are already live in computer security, software, online courses, system admin services, antivirus, and VPN software. These promotions offer deep discounts from various companies and are only available for a limited time. [...]"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "The best VPN for streaming in 2024: Expert tested and reviewed",
    "link": "https://www.zdnet.com/article/best-streaming-vpn/",
    "pubDate": "2024-11-27T13:39:00.000Z",
    "contentSnippet": "We've tested the best VPNs for streaming. These are the best VPNs available that won't be easily blocked by popular streaming platforms, including Netflix, and will offer high enough speeds to not impact your viewing experience."
  },
  {
    "site": "Schneier on Security",
    "title": "NSO Group Spies on People on Behalf of Governments",
    "link": "https://www.schneier.com/blog/archives/2024/11/nso-group-spies-on-people-on-behalf-of-governments.html",
    "pubDate": "2024-11-27T12:05:16.000Z",
    "contentSnippet": "The Israeli company NSO Group sells Pegasus spyware to countries around the world (including countries like Saudi Arabia, UAE, India, Mexico, Morocco and Rwanda). We assumed that those countries use the spyware themselves. Now we’ve  learned that that’s not true: that NSO Group employees operate the spyware on behalf of their customers.\nLegal documents released in ongoing US litigation between NSO Group and WhatsApp have revealed for the first time that the Israeli cyberweapons maker ­ and not its government customers ­ is the party that “installs and extracts” information from mobile phones targeted by the company’s hacking software..."
  },
  {
    "title": "Pro-Russian Hacktivists Launch Branded Ransomware Operations",
    "link": "https://www.infosecurity-magazine.com/news/russian-hacktivists-branded/",
    "pubDate": "2024-11-27T12:00:00.000Z",
    "contentSnippet": "A pro-Russian hacktivist collective, CyberVolk, has launched its own ransomware-as-a-service operations, SentinelLabs has found"
  },
  {
    "site": "The Hacker News",
    "title": "Latest Multi-Stage Attack Scenarios with Real-World Examples",
    "link": "https://thehackernews.com/2024/11/latest-multi-stage-attack-scenarios.html",
    "pubDate": "2024-11-27T11:30:00.000Z",
    "contentSnippet": "Multi-stage cyber attacks, characterized by their complex execution chains, are designed to avoid detection and trick victims into a false sense of security. Knowing how they operate is the first step to building a solid defense strategy against them. Let's examine real-world examples of some of the most common multi-stage attack scenarios that are active right now.\nURLs and Other Embedded"
  },
  {
    "site": "The Hacker News",
    "title": "APT-C-60 Hackers Exploit StatCounter and Bitbucket in SpyGlace Malware Campaign",
    "link": "https://thehackernews.com/2024/11/apt-c-60-exploits-wps-office.html",
    "pubDate": "2024-11-27T11:14:00.000Z",
    "contentSnippet": "The threat actor known as APT-C-60 has been linked to a cyber attack targeting an unnamed organization in Japan that used a job application-themed lure to deliver the SpyGlace backdoor.\nThat's according to findings from JPCERT/CC, which said the intrusion leveraged legitimate services like Google Drive, Bitbucket, and StatCounter. The attack was carried out around August 2024.\n\"In this attack,"
  },
  {
    "title": "Russian RomCom APT Group Leverages Zero-Day Flaws in Firefox and Windows",
    "link": "https://www.infosecurity-magazine.com/news/romcom-apt-zeroday-flaws-firefox/",
    "pubDate": "2024-11-27T11:00:00.000Z",
    "contentSnippet": "Russia-backed hackers, known as RomCom, have exploited critical zero-day vulnerabilities in Mozilla Firefox and Windows to launch targeted attacks"
  },
  {
    "site": "The Hacker News",
    "title": "INTERPOL Busts African Cybercrime: 1,006 Arrests, 134,089 Malicious Networks Dismantled",
    "link": "https://thehackernews.com/2024/11/interpol-busts-african-cybercrime-1006.html",
    "pubDate": "2024-11-27T07:20:00.000Z",
    "contentSnippet": "An INTERPOL-led operation has led to the arrest of 1,006 suspects across 19 African countries and the takedown of 134,089 malicious infrastructures and networks as part of a coordinated effort to disrupt cybercrime in the continent.\nDubbed Serengeti, the law enforcement exercise took place between September 2 and October 31, 2024, and targeted criminals behind ransomware, business email"
  },
  {
    "site": "The Hacker News",
    "title": "Matrix Botnet Exploits IoT Devices in Widespread DDoS Botnet Campaign",
    "link": "https://thehackernews.com/2024/11/matrix-botnet-exploits-iot-devices-in.html",
    "pubDate": "2024-11-27T05:21:00.000Z",
    "contentSnippet": "A threat actor named Matrix has been linked to a widespread distributed denial-of-service (DoD) campaign that leverages vulnerabilities and misconfigurations in Internet of Things (IoT) devices to co-opt them into a disruptive botnet.\n\"This operation serves as a comprehensive one-stop shop for scanning, exploiting vulnerabilities, deploying malware, and setting up shop kits, showcasing a"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Tech winners and losers of 2024: The year in true innovation and total product flops",
    "link": "https://www.zdnet.com/article/tech-winners-and-losers-of-2024-the-year-in-true-innovation-and-total-product-flops/",
    "pubDate": "2024-11-26T14:59:00.000Z",
    "contentSnippet": "AI flourished, Arm chips dominated, and open source thrived. Meanwhile, Elon Musk gets credit for two of the biggest losers, and Apple makes it onto both the naughty and nice lists."
  },
  {
    "site": "The Hacker News",
    "title": "Critical WordPress Anti-Spam Plugin Flaws Expose 200,000+ Sites to Remote Attacks",
    "link": "https://thehackernews.com/2024/11/critical-wordpress-anti-spam-plugin.html",
    "pubDate": "2024-11-26T13:23:00.000Z",
    "contentSnippet": "Two critical security flaws impacting the Spam protection, Anti-Spam, and FireWall plugin WordPress could allow an unauthenticated attacker to install and enable malicious plugins on susceptible sites and potentially achieve remote code execution.\nThe vulnerabilities, tracked as CVE-2024-10542 and CVE-2024-10781, carry a CVSS score of 9.8 out of a maximum of 10.0. They were addressed in versions"
  },
  {
    "site": "Schneier on Security",
    "title": "What Graykey Can and Can’t Unlock",
    "link": "https://www.schneier.com/blog/archives/2024/11/what-graykey-can-and-cant-unlock.html",
    "pubDate": "2024-11-26T12:01:41.000Z",
    "contentSnippet": "This is from 404 Media:\nThe Graykey, a phone unlocking and forensics tool that is used by law enforcement around the world, is only able to retrieve partial data from all modern iPhones that run iOS 18 or iOS 18.0.1, which are two recently released versions of Apple’s mobile operating system, according to documents describing the tool’s capabilities in granular detail obtained by 404 Media. The documents do not appear to contain information about what Graykey can access from the public release of iOS 18.1, which was released on October 28.\n\nMore ..."
  },
  {
    "site": "The Hacker News",
    "title": "Intruder Launches Intel: A Free Vulnerability Intelligence Platform For Staying Ahead of the Latest Threats",
    "link": "https://thehackernews.com/2024/11/intruder-launches-intel-free.html",
    "pubDate": "2024-11-26T11:30:00.000Z",
    "contentSnippet": "When CVEs go viral, separating critical vulnerabilities from the noise is essential to protecting your organization. That’s why Intruder, a leader in attack surface management, built Intel - a free vulnerability intelligence platform designed to help you act fast and prioritize real threats.\nWhat is Intel?\nIntel was created to fill a gap in the resources available for tracking emerging"
  },
  {
    "site": "The Hacker News",
    "title": "RomCom Exploits Zero-Day Firefox and Windows Flaws in Sophisticated Cyberattacks",
    "link": "https://thehackernews.com/2024/11/romcom-exploits-zero-day-firefox-and.html",
    "pubDate": "2024-11-26T10:34:00.000Z",
    "contentSnippet": "The Russia-aligned threat actor known as RomCom has been linked to the zero-day exploitation of two security flaws, one in Mozilla Firefox and the other in Microsoft Windows, as part of attacks designed to deliver the eponymous backdoor on victim systems.\n\"In a successful attack, if a victim browses a web page containing the exploit, an adversary can run arbitrary code – without any user"
  },
  {
    "site": "The Hacker News",
    "title": "Chinese Hackers Use GHOSTSPIDER Malware to Hack Telecoms Across 12+ Countries",
    "link": "https://thehackernews.com/2024/11/chinese-hackers-use-ghostspider-malware.html",
    "pubDate": "2024-11-26T10:19:00.000Z",
    "contentSnippet": "The China-linked threat actor known as Earth Estries has been observed using a previously undocumented backdoor called GHOSTSPIDER as part of its attacks targeting Southeast Asian telecommunications companies. \nTrend Micro, which described the hacking group as an aggressive advanced persistent threat (APT), said the intrusions also involved the use of another cross-platform backdoor dubbed"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "I tested 9 AI content detectors - and these 2 correctly identified AI text every time",
    "link": "https://www.zdnet.com/article/i-tested-9-ai-content-detectors-and-these-2-correctly-identified-ai-text-every-time/",
    "pubDate": "2024-11-26T09:22:00.000Z",
    "contentSnippet": "Two of the seven AI detectors I tested correctly identified AI-generated content 100% of the time. This is up from zero during my early rounds, but down from my last round of tests."
  },
  {
    "site": "The Hacker News",
    "title": "CISA Urges Agencies to Patch Critical \"Array Networks\" Flaw Amid Active Attacks",
    "link": "https://thehackernews.com/2024/11/cisa-urges-agencies-to-patch-critical.html",
    "pubDate": "2024-11-26T05:03:00.000Z",
    "contentSnippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added a now-patched critical security flaw impacting Array Networks AG and vxAG secure access gateways to its Known Exploited Vulnerabilities (KEV) catalog following reports of active exploitation in the wild.\nThe vulnerability, tracked as CVE-2023-28461 (CVSS score: 9.8), concerns a case of missing authentication that"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "LastPass adds passkey support for free and premium users (and now get up to 50% off plans for Black Friday)",
    "link": "https://www.zdnet.com/article/lastpass-adds-passkey-support-for-free-and-premium-users/",
    "pubDate": "2024-11-25T17:31:00.000Z",
    "contentSnippet": "LastPass users can take another step toward a password-less world. Here's how to activate the beta feature now."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Why you should power off your phone once a week - according to the NSA",
    "link": "https://www.zdnet.com/article/why-you-should-power-off-your-phone-once-a-week-according-to-the-nsa/",
    "pubDate": "2024-11-25T16:41:00.000Z",
    "contentSnippet": "This simple action can make it more difficult for hackers to steal information from your phone. Here's why and what else to know."
  },
  {
    "site": "The Hacker News",
    "title": "Google's New Restore Credentials Tool Simplifies App Login After Android Migration",
    "link": "https://thehackernews.com/2024/11/googles-new-restore-credentials-tool.html",
    "pubDate": "2024-11-25T14:22:00.000Z",
    "contentSnippet": "Google has introduced a new feature called Restore Credentials to help users restore their account access to third-party apps securely after migrating to a new Android device.\nPart of Android's Credential Manager API, the feature aims to reduce the hassle of re-entering the login credentials for every app during the handset replacement.\n\"With Restore Credentials, apps can seamlessly onboard"
  },
  {
    "site": "The Hacker News",
    "title": "PyPI Python Library \"aiocpa\" Found Exfiltrating Crypto Keys via Telegram Bot",
    "link": "https://thehackernews.com/2024/11/pypi-python-library-aiocpa-found.html",
    "pubDate": "2024-11-25T13:54:00.000Z",
    "contentSnippet": "The administrators of the Python Package Index (PyPI) repository have quarantined the package \"aiocpa\" following a new update that included malicious code to exfiltrate private keys via Telegram.\nThe package in question is described as a synchronous and asynchronous Crypto Pay API client. The package, originally released in September 2024, has been downloaded 12,100 times to date.\nBy putting the"
  },
  {
    "site": "Schneier on Security",
    "title": "Security Analysis of the MERGE Voting Protocol",
    "link": "https://www.schneier.com/blog/archives/2024/11/security-analysis-of-the-merge-voting-protocol.html",
    "pubDate": "2024-11-25T12:09:05.000Z",
    "contentSnippet": "Interesting analysis: An Internet Voting System Fatally Flawed in Creative New Ways.\nAbstract: The recently published “MERGE” protocol is designed to be used in the prototype CAC-vote system. The voting kiosk and protocol transmit votes over the internet and then transmit voter-verifiable paper ballots through the mail. In the MERGE protocol, the votes transmitted over the internet are used to tabulate the results and determine the winners, but audits and recounts use the paper ballots that arrive in time. The enunciated motivation for the protocol is to allow (electronic) votes from overseas military voters to be included in preliminary results before a (paper) ballot is received from the voter. MERGE contains interesting ideas that are not inherently unsound; but to make the system trustworthy—to apply the MERGE protocol—would require major changes to the laws, practices, and technical and logistical abilities of U.S. election jurisdictions. The gap between theory and practice is large and unbridgeable for the foreseeable future. Promoters of this research project at DARPA, the agency that sponsored the research, should acknowledge that MERGE is internet voting (election results rely on votes transmitted over the internet except in the event of a full hand count) and refrain from claiming that it could be a component of trustworthy elections without sweeping changes to election law and election administration throughout the U.S..."
  },
  {
    "site": "The Hacker News",
    "title": "THN Recap: Top Cybersecurity Threats, Tools, and Practices (Nov 18 - Nov 24)",
    "link": "https://thehackernews.com/2024/11/thn-recap-top-cybersecurity-threats_25.html",
    "pubDate": "2024-11-25T11:30:00.000Z",
    "contentSnippet": "We hear terms like “state-sponsored attacks” and “critical vulnerabilities” all the time, but what’s really going on behind those words? This week’s cybersecurity news isn’t just about hackers and headlines—it’s about how digital risks shape our lives in ways we might not even realize.\nFor instance, telecom networks being breached isn’t just about stolen data—it’s about power. Hackers are"
  },
  {
    "site": "The Hacker News",
    "title": "Flying Under the Radar - Security Evasion Techniques",
    "link": "https://thehackernews.com/2024/11/flying-under-radar-security-evasion.html",
    "pubDate": "2024-11-25T11:30:00.000Z",
    "contentSnippet": "Dive into the evolution of phishing and malware evasion techniques and understand how attackers are using increasingly sophisticated methods to bypass security measures.\nThe Evolution of Phishing Attacks\n“I really like the saying that ‘This is out of scope’ said no hacker ever. Whether it’s tricks, techniques or technologies, hackers will do anything to evade detection and make sure their"
  },
  {
    "site": "The Hacker News",
    "title": "Cybersecurity Blind Spots in IaC and PaC Tools Expose Cloud Platforms to New Attacks",
    "link": "https://thehackernews.com/2024/11/cybersecurity-flaws-in-iac-and-pac.html",
    "pubDate": "2024-11-25T11:24:00.000Z",
    "contentSnippet": "Cybersecurity researchers have disclosed two new attack techniques against infrastructure-as-code (IaC) and policy-as-code (PaC) tools like HashiCorp's Terraform and Styra's Open Policy Agent (OPA) that leverage dedicated, domain-specific languages (DSLs) to breach cloud platforms and exfiltrate data.\n\"Since these are hardened languages with limited capabilities, they're supposed to be more"
  },
  {
    "site": "The Hacker News",
    "title": "Researchers Uncover Malware Using BYOVD to Bypass Antivirus Protections",
    "link": "https://thehackernews.com/2024/11/researchers-uncover-malware-using-byovd.html",
    "pubDate": "2024-11-25T09:16:00.000Z",
    "contentSnippet": "Cybersecurity researchers have uncovered a new malicious campaign that leverages a technique called Bring Your Own Vulnerable Driver (BYOVD) to disarm security protections and ultimately gain access to the infected system.\n\"This malware takes a more sinister route: it drops a legitimate Avast Anti-Rootkit driver (aswArPot.sys) and manipulates it to carry out its destructive agenda,\" Trellix"
  },
  {
    "site": "The Hacker News",
    "title": "Google Exposes GLASSBRIDGE: A Pro-China Influence Network of Fake News Sites",
    "link": "https://thehackernews.com/2024/11/google-exposes-glassbridge-pro-china.html",
    "pubDate": "2024-11-23T12:10:00.000Z",
    "contentSnippet": "Government agencies and non-governmental organizations in the United States have become the target of a nascent China state threat actor known as Storm-2077.\nThe adversary, believed to be active since at least January 2024, has also conducted cyber attacks against the Defense Industrial Base (DIB), aviation, telecommunications, and financial and legal services across the world, Microsoft said."
  },
  {
    "site": "The Hacker News",
    "title": "North Korean Hackers Steal $10M with AI-Driven Scams and Malware on LinkedIn",
    "link": "https://thehackernews.com/2024/11/north-korean-hackers-steal-10m-with-ai.html",
    "pubDate": "2024-11-23T11:53:00.000Z",
    "contentSnippet": "The North Korea-linked threat actor known as Sapphire Sleet is estimated to have stolen more than $10 million worth of cryptocurrency as part of social engineering campaigns orchestrated over a six-month period.\nThese findings come from Microsoft, which said that multiple threat activity clusters with ties to the country have been observed creating fake profiles on LinkedIn, posing as both"
  },
  {
    "site": "Schneier on Security",
    "title": "Friday Squid Blogging: Transcriptome Analysis of the Indian Squid",
    "link": "https://www.schneier.com/blog/archives/2024/11/friday-squid-blogging-transcriptome-analysis-of-the-indian-squid.html",
    "pubDate": "2024-11-22T22:01:32.000Z",
    "contentSnippet": "Lots of details that are beyond me.\nBlog moderation policy."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "This new wireless carrier promises ultra-secure mobile phone service",
    "link": "https://www.zdnet.com/article/this-new-wireless-carrier-promises-ultra-secure-mobile-phone-service/",
    "pubDate": "2024-11-22T20:57:00.000Z",
    "contentSnippet": "This mobile provider service was available only to government users but has since expanded. If you fall into these categories, you may be eligible today, but the service will expand to the general public soon, too."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "You can finally test Microsoft's controversial Recall feature - here's how",
    "link": "https://www.zdnet.com/article/you-can-finally-test-microsofts-controversial-recall-feature-heres-how/",
    "pubDate": "2024-11-22T18:00:00.000Z",
    "contentSnippet": "What was supposed to be a signature feature of the AI-powered Copilot+ PCs for Windows 11 was delayed after a firestorm of privacy and security complaints. But it's ready for testing now, if you have the right hardware."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "The best VPN services for iPhone: Expert tested and reviewed",
    "link": "https://www.zdnet.com/article/best-iphone-vpn/",
    "pubDate": "2024-11-22T17:35:00.000Z",
    "contentSnippet": "We tested and analyzed popular VPNs compatible with Apple's iPhone range and the iOS operating system to find the best options for protecting your privacy, streaming content, and more."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "One year later: 7 useful things the Flipper Zero can do that still blows my mind",
    "link": "https://www.zdnet.com/article/one-year-later-the-flipper-zero-is-still-cool-here-are-7-useful-things-you-can-do/",
    "pubDate": "2024-11-22T17:34:00.000Z",
    "contentSnippet": "This weird little device blew up on TikTok, but there's more to it than what lies on the surface. Here are some of the most useful features I've discovered."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "The best VPN routers of 2024",
    "link": "https://www.zdnet.com/article/best-vpn-router/",
    "pubDate": "2024-11-22T17:11:00.000Z",
    "contentSnippet": "Looking for a new router to give your home blanket VPN coverage? These are the best VPN-ready routers that provide secure, fast, and reliable internet connections."
  },
  {
    "site": "The Hacker News",
    "title": "APT-K-47 Uses Hajj-Themed Lures to Deliver Advanced Asyncshell Malware",
    "link": "https://thehackernews.com/2024/11/apt-k-47-uses-hajj-themed-lures-to.html",
    "pubDate": "2024-11-22T16:59:00.000Z",
    "contentSnippet": "The threat actor known as Mysterious Elephant has been observed using an advanced version of malware called Asyncshell.\nThe attack campaign is said to have used Hajj-themed lures to trick victims into executing a malicious payload under the guise of a Microsoft Compiled HTML Help (CHM) file, the Knownsec 404 team said in an analysis published today.\nMysterious Elephant, which is also known as"
  },
  {
    "site": "The Hacker News",
    "title": "Russian Hackers Deploy HATVIBE and CHERRYSPY Malware Across Europe and Asia",
    "link": "https://thehackernews.com/2024/11/russian-hackers-deploy-hatvibe-and.html",
    "pubDate": "2024-11-22T16:59:00.000Z",
    "contentSnippet": "Threat actors with ties to Russia have been linked to a cyber espionage campaign aimed at organizations in Central Asia, East Asia, and Europe.\nRecorded Future's Insikt Group, which has assigned the activity cluster the name TAG-110, said it overlaps with a threat group tracked by the Computer Emergency Response Team of Ukraine (CERT-UA) as UAC-0063, which, in turn, overlaps with APT28. The"
  },
  {
    "site": "The Hacker News",
    "title": "China-Linked TAG-112 Targets Tibetan Media with Cobalt Strike Espionage Campaign",
    "link": "https://thehackernews.com/2024/11/china-linked-tag-112-targets-tibetan.html",
    "pubDate": "2024-11-22T16:47:00.000Z",
    "contentSnippet": "A China-linked nation-state group called TAG-112 compromised Tibetan media and university websites in a new cyber espionage campaign designed to facilitate the delivery of the Cobalt Strike post-exploitation toolkit for follow-on information collection.\n\"The attackers embedded malicious JavaScript in these sites, which spoofed a TLS certificate error to trick visitors into downloading a"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "I deleted my personal info from the internet with this service (and it's on sale for Black Friday)",
    "link": "https://www.zdnet.com/article/i-deleted-my-personal-info-from-the-internet-with-this-service-and-its-on-sale-for-black-friday/",
    "pubDate": "2024-11-22T14:00:19.000Z",
    "contentSnippet": "DeleteMe helps remove your address, phone number, and other personal information from online platforms to protect you from identity theft, robocalls, and data breaches -- and it's 25% off for Black Friday."
  },
  {
    "site": "Schneier on Security",
    "title": "The Scale of Geoblocking by Nation",
    "link": "https://www.schneier.com/blog/archives/2024/11/the-scale-of-geoblocking-by-nation.html",
    "pubDate": "2024-11-22T12:06:07.000Z",
    "contentSnippet": "Interesting analysis:\nWe introduce and explore a little-known threat to digital equality and freedom­websites geoblocking users in response to political risks from sanctions. U.S. policy prioritizes internet freedom and access to information in repressive regimes. Clarifying distinctions between free and paid websites, allowing trunk cables to repressive states, enforcing transparency in geoblocking, and removing ambiguity about sanctions compliance are concrete steps the U.S. can take to ensure it does not undermine its own aims.\n\nThe paper: “..."
  },
  {
    "site": "The Hacker News",
    "title": "Unlocking Google Workspace Security: Are You Doing Enough to Protect Your Data?",
    "link": "https://thehackernews.com/2024/11/the-importance-of having-a-google-workspace-backup-solution.html",
    "pubDate": "2024-11-22T11:30:00.000Z",
    "contentSnippet": "Google Workspace has quickly become the productivity backbone for businesses worldwide, offering an all-in-one suite with email, cloud storage and collaboration tools. This single-platform approach makes it easy for teams to connect and work efficiently, no matter where they are, enabling seamless digital transformation that’s both scalable and adaptable.\nAs companies shift from traditional,"
  },
  {
    "site": "The Hacker News",
    "title": "Microsoft, Meta, and DOJ Disrupt Global Cybercrime and Fraudulent Networks",
    "link": "https://thehackernews.com/2024/11/microsoft-meta-and-doj-disrupt-global.html",
    "pubDate": "2024-11-22T09:37:00.000Z",
    "contentSnippet": "Meta Platforms, Microsoft, and the U.S. Department of Justice (DoJ) have announced independent actions to tackle cybercrime and disrupt services that enable scams, fraud, and phishing attacks.\nTo that end, Microsoft's Digital Crimes Unit (DCU) said it seized 240 fraudulent websites associated with an Egypt-based cybercrime facilitator named Abanoub Nady (aka MRxC0DER and mrxc0derii), who"
  },
  {
    "site": "The Hacker News",
    "title": "PyPI Attack: ChatGPT, Claude Impersonators Deliver JarkaStealer via Python Libraries",
    "link": "https://thehackernews.com/2024/11/pypi-attack-chatgpt-claude.html",
    "pubDate": "2024-11-22T06:15:00.000Z",
    "contentSnippet": "Cybersecurity researchers have discovered two malicious packages uploaded to the Python Package Index (PyPI) repository that impersonated popular artificial intelligence (AI) models like OpenAI ChatGPT and Anthropic Claude to deliver an information stealer called JarkaStealer.\nThe packages, named gptplus and claudeai-eng, were uploaded by a user named \"Xeroline\" in November 2023, attracting"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "The best AirTag wallets of 2024: Expert tested",
    "link": "https://www.zdnet.com/article/best-airtag-wallet/",
    "pubDate": "2024-11-21T16:48:14.000Z",
    "contentSnippet": "We tested the best Apple AirTag wallets and tracking accessories from Nomad, ESR, Ridge, and more to help you keep track of your cards and cash."
  },
  {
    "site": "The Hacker News",
    "title": "Warning: Over 2,000 Palo Alto Networks Devices Hacked in Ongoing Attack Campaign",
    "link": "https://thehackernews.com/2024/11/warning-over-2000-palo-alto-networks.html",
    "pubDate": "2024-11-21T16:22:00.000Z",
    "contentSnippet": "As many as 2,000 Palo Alto Networks devices are estimated to have been compromised as part of a campaign abusing the newly disclosed security flaws that have come under active exploitation in the wild.\nAccording to statistics shared by the Shadowserver Foundation, a majority of the infections have been reported in the U.S. (554) and India (461), followed by Thailand (80), Mexico (48), Indonesia"
  },
  {
    "site": "The Hacker News",
    "title": "Chinese APT Gelsemium Targets Linux Systems with New WolfsBane Backdoor",
    "link": "https://thehackernews.com/2024/11/chinese-apt-gelsemium-targets-linux.html",
    "pubDate": "2024-11-21T15:50:00.000Z",
    "contentSnippet": "The China-aligned advanced persistent threat (APT) actor known as Gelsemium has been observed using a new Linux backdoor dubbed WolfsBane as part of cyber attacks likely targeting East and Southeast Asia.\nThat's according to findings from cybersecurity firm ESET based on multiple Linux samples uploaded to the VirusTotal platform from Taiwan, the Philippines, and Singapore in March 2023."
  },
  {
    "site": "The Hacker News",
    "title": "10 Most Impactful PAM Use Cases for Enhancing Organizational Security",
    "link": "https://thehackernews.com/2024/11/10-most-impactful-pam-use-cases-for.html",
    "pubDate": "2024-11-21T12:23:00.000Z",
    "contentSnippet": "Privileged access management (PAM) plays a pivotal role in building a strong security strategy. PAM empowers you to significantly reduce cybersecurity risks, gain tighter control over privileged access, achieve regulatory compliance, and reduce the burden on your IT team. \nAs an established provider of a PAM solution, we’ve witnessed firsthand how PAM transforms organizational security. In"
  },
  {
    "site": "The Hacker News",
    "title": "North Korean Front Companies Impersonate U.S. IT Firms to Fund Missile Programs",
    "link": "https://thehackernews.com/2024/11/north-korean-front-companies.html",
    "pubDate": "2024-11-21T12:04:00.000Z",
    "contentSnippet": "Threat actors with ties to the Democratic People's Republic of Korea (DPRK) are impersonating U.S.-based software and technology consulting businesses in order to further their financial objectives as part of a broader information technology (IT) worker scheme.\n\"Front companies, often based in China, Russia, Southeast Asia, and Africa, play a key role in masking the workers' true origins and"
  },
  {
    "site": "Schneier on Security",
    "title": "Secret Service Tracking People’s Locations without Warrant",
    "link": "https://www.schneier.com/blog/archives/2024/11/secret-service-tracking-peoples-locations-without-warrant.html",
    "pubDate": "2024-11-21T12:03:18.000Z",
    "contentSnippet": "This feels important:\nThe Secret Service has used a technology called Locate X which uses location data harvested from ordinary apps installed on phones. Because users agreed to an opaque terms of service page, the Secret Service believes it doesn’t need a warrant."
  },
  {
    "site": "The Hacker News",
    "title": "Cyber Story Time: The Boy Who Cried \"Secure!\"",
    "link": "https://thehackernews.com/2024/11/cyber-story-time-boy-who-cried-secure.html",
    "pubDate": "2024-11-21T11:30:00.000Z",
    "contentSnippet": "As a relatively new security category, many security operators and executives I’ve met have asked us “What are these Automated Security Validation (ASV) tools?” We’ve covered that pretty extensively in the past, so today, instead of covering the “What is ASV?” I wanted to address the “Why ASV?” question. In this article, we’ll cover some common use cases and misconceptions of how people misuse"
  },
  {
    "site": "The Hacker News",
    "title": "Over 145,000 Industrial Control Systems Across 175 Countries Found Exposed Online",
    "link": "https://thehackernews.com/2024/11/over-145000-industrial-control-systems.html",
    "pubDate": "2024-11-21T11:00:00.000Z",
    "contentSnippet": "New research has uncovered more than 145,000 internet-exposed Industrial Control Systems (ICS) across 175 countries, with the U.S. alone accounting for over one-third of the total exposures.\nThe analysis, which comes from attack surface management company Censys, found that 38% of the devices are located in North America, 35.4% in Europe, 22.9% in Asia, 1.7% in Oceania, 1.2% in South America,"
  },
  {
    "site": "The Hacker News",
    "title": "5 Scattered Spider Gang Members Indicted in Multi-Million Dollar Cybercrime Scheme",
    "link": "https://thehackernews.com/2024/11/5-scattered-spider-gang-members.html",
    "pubDate": "2024-11-21T09:16:00.000Z",
    "contentSnippet": "Five alleged members of the infamous Scattered Spider cybercrime crew have been indicted in the U.S. for targeting employees of companies across the country using social engineering techniques to harvest credentials and using them to gain unauthorized access to sensitive data and break into crypto accounts to steal digital assets worth millions of dollars.\nAll of the accused parties have been"
  },
  {
    "site": "The Hacker News",
    "title": "Google's AI-Powered OSS-Fuzz Tool Finds 26 Vulnerabilities in Open-Source Projects",
    "link": "https://thehackernews.com/2024/11/googles-ai-powered-oss-fuzz-tool-finds.html",
    "pubDate": "2024-11-21T07:13:00.000Z",
    "contentSnippet": "Google has revealed that its AI-powered fuzzing tool, OSS-Fuzz, has been used to help identify 26 vulnerabilities in various open-source code repositories, including a medium-severity flaw in the OpenSSL cryptographic library.\n\"These particular vulnerabilities represent a milestone for automated vulnerability finding: each was found with AI, using AI-generated and enhanced fuzz targets,\""
  },
  {
    "site": "The Hacker News",
    "title": "NodeStealer Malware Targets Facebook Ad Accounts, Harvesting Credit Card Data",
    "link": "https://thehackernews.com/2024/11/nodestealer-malware-targets-facebook-ad.html",
    "pubDate": "2024-11-21T06:34:00.000Z",
    "contentSnippet": "Threat hunters are warning about an updated version of the Python-based NodeStealer that's now equipped to extract more information from victims' Facebook Ads Manager accounts and harvest credit card data stored in web browsers.\n\"They collect budget details of Facebook Ads Manager accounts of their victims, which might be a gateway for Facebook malvertisement,\" Netskope Threat Labs researcher"
  },
  {
    "site": "Schneier on Security",
    "title": "Steve Bellovin’s Retirement Talk",
    "link": "https://www.schneier.com/blog/archives/2024/11/steve-bellovins-retirement-talk.html",
    "pubDate": "2024-11-20T16:22:59.000Z",
    "contentSnippet": "Steve Bellovin is retiring. Here’s his retirement talk, reflecting on his career and what the cybersecurity field needs next."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Why I recommend the Blink Mini 2 security camera over the Wyze Cam (and it's only $30 right now)",
    "link": "https://www.zdnet.com/article/why-i-recommend-the-blink-mini-2-security-camera-over-the-wyze-cam-and-its-only-30-right-now/",
    "pubDate": "2024-11-20T15:28:21.000Z",
    "contentSnippet": "The Blink Mini 2 is feature-rich, and it includes a waterproof adapter that makes it that much sweeter. Currently, it's available on Amazon for just $30."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Update your iPhone, iPad, and Mac now to patch these serious zero-day security flaws",
    "link": "https://www.zdnet.com/article/update-your-iphone-ipad-and-mac-now-to-patch-these-serious-zero-day-security-flaws/",
    "pubDate": "2024-11-20T14:03:00.000Z",
    "contentSnippet": "The emergency updates resolve two zero-day flaws that may have already been exploited in the wild."
  },
  {
    "site": "The Hacker News",
    "title": "Ghost Tap: Hackers Exploiting NFCGate to Steal Funds via Mobile Payments",
    "link": "https://thehackernews.com/2024/11/ghost-tap-hackers-exploiting-nfcgate-to.html",
    "pubDate": "2024-11-20T13:09:00.000Z",
    "contentSnippet": "Threat actors are increasingly banking on a new technique that leverages near-field communication (NFC) to cash out victim's funds at scale.\nThe technique, codenamed Ghost Tap by ThreatFabric, enables cybercriminals to cash-out money from stolen credit cards linked to mobile payment services such as Google Pay or Apple Pay and relaying NFC traffic.\n\"Criminals can now misuse Google Pay and Apple"
  },
  {
    "site": "The Hacker News",
    "title": "NHIs Are the Future of Cybersecurity: Meet NHIDR",
    "link": "https://thehackernews.com/2024/11/nhis-are-future-of-cybersecurity-meet.html",
    "pubDate": "2024-11-20T11:30:00.000Z",
    "contentSnippet": "The frequency and sophistication of modern cyberattacks are surging, making it increasingly challenging for organizations to protect sensitive data and critical infrastructure. When attackers compromise a non-human identity (NHI), they can swiftly exploit it to move laterally across systems, identifying vulnerabilities and compromising additional NHIs in minutes. While organizations often take"
  },
  {
    "site": "The Hacker News",
    "title": "Decades-Old Security Vulnerabilities Found in Ubuntu's Needrestart Package",
    "link": "https://thehackernews.com/2024/11/decades-old-security-vulnerabilities.html",
    "pubDate": "2024-11-20T09:16:00.000Z",
    "contentSnippet": "Multiple decade-old security vulnerabilities have been disclosed in the needrestart package installed by default in Ubuntu Server (since version 21.04) that could allow a local attacker to gain root privileges without requiring user interaction.\nThe Qualys Threat Research Unit (TRU), which identified and reported the flaws early last month, said they are trivial to exploit, necessitating that"
  },
  {
    "site": "The Hacker News",
    "title": "Microsoft Launches Windows Resiliency Initiative to Boost Security and System Integrity",
    "link": "https://thehackernews.com/2024/11/microsoft-launches-windows-resiliency.html",
    "pubDate": "2024-11-20T07:00:00.000Z",
    "contentSnippet": "Microsoft has announced a new Windows Resiliency Initiative as a way to improve security and reliability, as well as ensure that system integrity is not compromised.\nThe idea, the tech giant said, is to avoid incidents like that of CrowdStrike's earlier this July, enable more apps and users to be run without admin privileges, add controls surrounding the use of unsafe apps and drivers, and offer"
  },
  {
    "site": "The Hacker News",
    "title": "China-Backed Hackers Leverage SIGTRAN, GSM Protocols to Infiltrate Telecom Networks",
    "link": "https://thehackernews.com/2024/11/china-backed-hackers-leverage-sigtran.html",
    "pubDate": "2024-11-20T06:58:00.000Z",
    "contentSnippet": "A new China-linked cyber espionage group has been attributed as behind a series of targeted cyber attacks targeting telecommunications entities in South Asia and Africa since at least 2020 with the goal of enabling intelligence collection.\nCybersecurity company CrowdStrike is tracking the adversary under the name Liminal Panda, describing it as possessing deep knowledge about telecommunications"
  },
  {
    "site": "The Hacker News",
    "title": "Apple Releases Urgent Updates to Patch Actively Exploited Zero-Day Vulnerabilities",
    "link": "https://thehackernews.com/2024/11/apple-releases-urgent-updates-to-patch.html",
    "pubDate": "2024-11-20T04:37:00.000Z",
    "contentSnippet": "Apple has released security updates for iOS, iPadOS, macOS, visionOS, and its Safari web browser to address two zero-day flaws that have come under active exploitation in the wild.\nThe flaws are listed below -\n\nCVE-2024-44308 (CVSS score: 8.8) - A vulnerability in JavaScriptCore that could lead to arbitrary code execution when processing malicious web content\nCVE-2024-44309 (CVSS score: 6.1"
  },
  {
    "site": "The Hacker News",
    "title": "Oracle Warns of Agile PLM Vulnerability Currently Under Active Exploitation",
    "link": "https://thehackernews.com/2024/11/oracle-warns-of-agile-plm-vulnerability.html",
    "pubDate": "2024-11-20T04:24:00.000Z",
    "contentSnippet": "Oracle is warning that a high-severity security flaw impacting the Agile Product Lifecycle Management (PLM) Framework has been exploited in the wild.\nThe vulnerability, tracked as CVE-2024-21287 (CVSS score: 7.5), could be exploited sans authentication to leak sensitive information.\n\"This vulnerability is remotely exploitable without authentication, i.e., it may be exploited over a network"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "'Scam yourself' attacks just increased over 600% - here's what to look for",
    "link": "https://www.zdnet.com/article/scam-yourself-attacks-just-increased-over-600-heres-what-to-look-for/",
    "pubDate": "2024-11-19T21:36:04.000Z",
    "contentSnippet": "Millions of people are falling for these scams, but they're not unavoidable. Here's what you need to know."
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Microsoft offers $4 million in AI and cloud bug bounties - how to qualify",
    "link": "https://www.zdnet.com/article/microsoft-offers-4-million-in-ai-and-cloud-bug-bounties-how-to-qualify/",
    "pubDate": "2024-11-19T19:59:48.000Z",
    "contentSnippet": "The company's Zero Day Quest hacking event will reward researchers who find new security flaws."
  },
  {
    "site": "The Hacker News",
    "title": "Ngioweb Botnet Fuels NSOCKS Residential Proxy Network Exploiting IoT Devices",
    "link": "https://thehackernews.com/2024/11/ngioweb-botnet-fuels-nsocks-residential.html",
    "pubDate": "2024-11-19T14:01:00.000Z",
    "contentSnippet": "The malware known as Ngioweb has been used to fuel a notorious residential proxy service called NSOCKS, as well as by other services such as VN5Socks and Shopsocks5, new findings from Lumen Technologies reveal.\n\"At least 80% of NSOCKS bots in our telemetry originate from the Ngioweb botnet, mainly utilizing small office/home office (SOHO) routers and IoT devices,\" the Black Lotus Labs team at"
  },
  {
    "site": "The Hacker News",
    "title": "Hackers Hijack Unsecured Jupyter Notebooks to Stream Illegal Sports Broadcasts",
    "link": "https://thehackernews.com/2024/11/hackers-hijack-unsecured-jupyter.html",
    "pubDate": "2024-11-19T14:00:00.000Z",
    "contentSnippet": "Malicious actors are exploiting misconfigured JupyterLab and Jupyter Notebooks to conduct stream ripping and enable sports piracy using live streaming capture tools.\nThe attacks involve the hijack of unauthenticated Jupyter Notebooks to establish initial access, and perform a series of actions designed to facilitate illegal live streaming of sports events, Aqua said in a report shared with The"
  },
  {
    "site": "Latest stories for ZDNET in Security",
    "title": "Microsoft to tighten Windows security dramatically in 2025 - here's how",
    "link": "https://www.zdnet.com/article/microsoft-to-tighten-windows-security-dramatically-in-2025-heres-how/",
    "pubDate": "2024-11-19T13:30:00.000Z",
    "contentSnippet": "Stung by last summer's CrowdStrike meltdown, which crashed Windows PCs and servers worldwide, Microsoft is rolling out a wide range of security changes to Windows. Here's what to expect over the next year"
  },
  {
    "site": "Schneier on Security",
    "title": "Why Italy Sells So Much Spyware",
    "link": "https://www.schneier.com/blog/archives/2024/11/why-italy-sells-so-much-spyware.html",
    "pubDate": "2024-11-19T12:05:31.000Z",
    "contentSnippet": "Interesting analysis:\nAlthough much attention is given to sophisticated, zero-click spyware developed by companies like Israel’s NSO Group, the Italian spyware marketplace has been able to operate relatively under the radar by specializing in cheaper tools. According to an Italian Ministry of Justice document, as of December 2022 law enforcement in the country could rent spyware for €150 a day, regardless of which vendor they used, and without the large acquisition costs which would normally be prohibitive.\nAs a result, thousands of spyware operations have been carried out by Italian authorities in recent years, according to a ..."
  },
  {
    "site": "CISA News",
    "title": "CISA Releases Venue Guide for Security Considerations",
    "link": "https://www.cisa.gov/news-events/news/cisa-releases-venue-guide-security-considerations",
    "pubDate": "2024-11-19T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "The Hacker News",
    "title": "Privileged Accounts, Hidden Threats: Why Privileged Access Security Must Be a Top Priority",
    "link": "https://thehackernews.com/2024/11/privileged-accounts-hidden-threats-why.html",
    "pubDate": "2024-11-19T11:30:00.000Z",
    "contentSnippet": "Privileged accounts are well-known gateways for potential security threats. However, many organizations focus solely on managing privileged access—rather than securing the accounts and users entrusted with it. This emphasis is perhaps due to the persistent challenges of Privileged Access Management (PAM) deployments. Yet, as the threat landscape evolves, so must organizational priorities. To"
  },
  {
    "site": "Schneier on Security",
    "title": "Most of 2023’s Top Exploited Vulnerabilities Were Zero-Days",
    "link": "https://www.schneier.com/blog/archives/2024/11/most-of-2023s-top-exploited-vulnerabilities-were-zero-days.html",
    "pubDate": "2024-11-18T15:49:29.000Z",
    "contentSnippet": "Zero-day vulnerabilities are more commonly used, according to the Five Eyes:\nKey Findings\nIn 2023, malicious cyber actors exploited more zero-day vulnerabilities to compromise enterprise networks compared to 2022, allowing them to conduct cyber operations against higher-priority targets. In 2023, the majority of the most frequently exploited vulnerabilities were initially exploited as a zero-day, which is an increase from 2022, when less than half of the top exploited vulnerabilities were exploited as a zero-day.\nMalicious cyber actors continue to have the most success exploiting vulnerabilities within two years after public disclosure of the vulnerability. The utility of these vulnerabilities declines over time as more systems are patched or replaced. Malicious cyber actors find less utility from zero-day exploits when international cybersecurity efforts reduce the lifespan of zero-day vulnerabilities..."
  },
  {
    "site": "CISA News",
    "title": "CISA Launches New Learning Platform to Enhance Training and Education U.S. Veterans and Other Stakeholders   ",
    "link": "https://www.cisa.gov/news-events/news/cisa-launches-new-learning-platform-enhance-training-and-education-us-veterans-and-other",
    "pubDate": "2024-11-18T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "Schneier on Security",
    "title": "Friday Squid Blogging: Female Gonatus Onyx Squid Carrying Her Eggs",
    "link": "https://www.schneier.com/blog/archives/2024/11/friday-squid-blogging-female-gonatus-onyx-squid-carrying-her-eggs.html",
    "pubDate": "2024-11-15T22:07:02.000Z",
    "contentSnippet": "Fantastic video of a female Gonatus onyx squid swimming while carrying her egg sack.\nAn earlier related post.\nBlog moderation policy."
  },
  {
    "site": "CISA News",
    "title": "Joint Statement from FBI and CISA on the People's Republic of China (PRC) Targeting of Commercial Telecommunications Infrastructure",
    "link": "https://www.cisa.gov/news-events/news/joint-statement-fbi-and-cisa-peoples-republic-china-prc-targeting-commercial-telecommunications",
    "pubDate": "2024-11-13T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "CISA Kicks Off Critical Infrastructure Security and Resilience Month 2024 ",
    "link": "https://www.cisa.gov/news-events/news/cisa-kicks-critical-infrastructure-security-and-resilience-month-2024",
    "pubDate": "2024-11-07T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "Statement from CISA Director Easterly on the Security of the 2024 Elections",
    "link": "https://www.cisa.gov/news-events/news/statement-cisa-director-easterly-security-2024-elections",
    "pubDate": "2024-11-06T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "Joint ODNI, FBI, and CISA Statement",
    "link": "https://www.cisa.gov/news-events/news/joint-odni-fbi-and-cisa-statement-1",
    "pubDate": "2024-11-04T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "Joint Statement from CISA and EAC in Support of State and Local Election Officials",
    "link": "https://www.cisa.gov/news-events/news/joint-statement-cisa-and-eac-support-state-and-local-election-officials",
    "pubDate": "2024-11-04T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "Joint ODNI, FBI, and CISA Statement on Russian Election Influence Efforts",
    "link": "https://www.cisa.gov/news-events/news/joint-odni-fbi-and-cisa-statement-russian-election-influence-efforts",
    "pubDate": "2024-11-01T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "CISA Releases Its First Ever International Strategic Plan ",
    "link": "https://www.cisa.gov/news-events/news/cisa-releases-its-first-ever-international-strategic-plan",
    "pubDate": "2024-10-29T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "CISA News",
    "title": "CISA Launches #PROTECT2024 Election Threat Updates Webpage",
    "link": "https://www.cisa.gov/news-events/news/cisa-launches-protect2024-election-threat-updates-webpage",
    "pubDate": "2024-10-28T12:00:00.000Z",
    "contentSnippet": ""
  },
  {
    "site": "Threatpost",
    "title": "Student Loan Breach Exposes 2.5M Records",
    "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
    "pubDate": "2022-08-31T12:57:48.000Z",
    "contentSnippet": "2.5 million people were affected, in a breach that could spell more trouble down the line."
  },
  {
    "site": "Threatpost",
    "title": "Watering Hole Attacks Push ScanBox Keylogger",
    "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
    "pubDate": "2022-08-30T16:00:43.000Z",
    "contentSnippet": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool."
  },
  {
    "site": "Threatpost",
    "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
    "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
    "pubDate": "2022-08-29T14:56:19.000Z",
    "contentSnippet": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system."
  },
  {
    "site": "Threatpost",
    "title": "Ransomware Attacks are on the Rise",
    "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
    "pubDate": "2022-08-26T16:44:27.000Z",
    "contentSnippet": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group."
  },
  {
    "site": "Threatpost",
    "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
    "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
    "pubDate": "2022-08-25T18:47:15.000Z",
    "contentSnippet": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed."
  },
  {
    "site": "Threatpost",
    "title": "Twitter Whistleblower Complaint: The TL;DR Version",
    "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
    "pubDate": "2022-08-24T14:17:04.000Z",
    "contentSnippet": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk."
  },
  {
    "site": "Threatpost",
    "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
    "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
    "pubDate": "2022-08-23T13:19:58.000Z",
    "contentSnippet": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP."
  },
  {
    "site": "Threatpost",
    "title": "Fake Reservation Links Prey on Weary Travelers",
    "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
    "pubDate": "2022-08-22T13:59:06.000Z",
    "contentSnippet": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels."
  },
  {
    "site": "Threatpost",
    "title": "iPhone Users Urged to Update to Patch 2 Zero-Days",
    "link": "https://threatpost.com/iphone-users-urged-to-update-to-patch-2-zero-days-under-attack/180448/",
    "pubDate": "2022-08-19T15:25:56.000Z",
    "contentSnippet": "Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack."
  },
  {
    "site": "Threatpost",
    "title": "Google Patches Chrome’s Fifth Zero-Day of the Year",
    "link": "https://threatpost.com/google-patches-chromes-fifth-zero-day-of-the-year/180432/",
    "pubDate": "2022-08-18T14:31:38.000Z",
    "contentSnippet": "An insufficient validation input flaw, one of 11 patched in an update this week, could allow for arbitrary code execution and is under active attack."
  }
]